TSD_TK/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвиженияДС</name>
    <type>
      <types>EnumRef.ВидыДвиженияДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

TSD_TK/src/Enums/ТипыОплаты/ТипыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплаты</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/Enums/ВидыДвиженияДС/ВидыДвиженияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженияДС</name>
  <enumValues>
    <name>Внесение</name>
  </enumValues>
  <enumValues>
    <name>Изъятие</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/Enums/СтатусыЧеков/СтатусыЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЧеков</name>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Пробит</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>АдресEmailПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>0 - продажа, 1 - возврат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдресаМестоположения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплатыЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧека</name>
    <type>
      <types>EnumRef.СтатусыЧеков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПродажи</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаАкцизнойМарки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьШтрихкодаПриПродаже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСУчетомСкидки</name>
      <comment>Заполняется только при возврате товаров. Идентифицирует позицию чека продажи.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АкцизныеМарки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАкцизнойМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлатежнойСистемы</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПлатежнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСсылкиОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлипЧек</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TSD_TK/src/CommonModules/Продажи/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбновитьИнформациюПоКассовойСмене(Форма, УстановитьГиперссылку = Истина) Экспорт
	
	КассоваяСмена = ПродажиВызовСервераПовтИсп.ПолучитьСмену(Ложь);
	КассоваяСменаПросрочена = Ложь;
	
	Если Не ЗначениеЗаполнено(КассоваяСмена) Тогда
		
		СменаОткрыта = Ложь;
		
		ИнформацияОСмене = НСтр("ru = 'Смена открывается автоматически'");
		Форма.Элементы.ИнформацияОСмене.ЦветТекста = WebЦвета.Серый;
		Форма.Элементы.ИнформацияОСмене.Гиперссылка = Ложь;
		
	Иначе
		
		СменаОткрыта = Истина;
		
		ИнформацияОСменеТекст = НСтр("ru = 'Смена открыта %Просрочена%
			|%ДатаОткрытия%'");
		
		ИнформацияОСменеТекст = СтрЗаменить(ИнформацияОСменеТекст, "%ДатаОткрытия%", Формат(КассоваяСмена.НачалоКассовойСмены, "ДФ='HH:mm:ss dd.MM.yyyy '"));
		
		Если КассоваяСменаПросрочена(КассоваяСмена) Тогда
			
			ИнформацияОСмене = СтрЗаменить(ИнформацияОСменеТекст, "%Просрочена%", НСтр("ru = 'более 24 часов'"));
			
			Форма.Элементы.ИнформацияОСмене.ЦветТекста = ЗначениеНастроекКлиентСерверПовтИсп.ЦветПоляОшибка();
			Форма.Элементы.ИнформацияОСмене.Гиперссылка = УстановитьГиперссылку;
			КассоваяСменаПросрочена = Истина;
			
		Иначе
			
			ИнформацияОСмене = СтрЗаменить(ИнформацияОСменеТекст, "%Просрочена%", "");
			Форма.Элементы.ИнформацияОСмене.ЦветТекста = ЗначениеНастроекКлиентСерверПовтИсп.ЦветИнформационнойНадписи();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.КассоваяСмена 			= КассоваяСмена;
	Форма.ИнформацияОСмене 			= ИнформацияОСмене;
	Форма.КассоваяСменаПросрочена 	= КассоваяСменаПросрочена;
	Форма.КассоваяСменаОткрыта		= СменаОткрыта;
	
КонецПроцедуры

Функция КассоваяСменаПросрочена(КассоваяСмена) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату() - КассоваяСмена.НачалоКассовойСмены > 86400;
	
КонецФункции

// Процедура распределяет сумму ручной скидки по строкам табличной части документа.
// Параметры:
//		Объект - Документ, табличная часть которого обрабатывается.
//		ИмяТЧ - Строка - имя табличной части с товарами.
//		СуммаСкидкиКРаспределению - Число - сумма ручной скидки, которую нужно распределить.
//		
Процедура НазначитьСкидкуНаДокумент(Объект, ИмяТЧ, Знач СуммаСкидкиКРаспределению) Экспорт
	
	МаксимальнаяСуммаСкидки = 0;
	
	ЭтоНаценка = СуммаСкидкиКРаспределению > 0;
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		
		МаксимальнаяСуммаСкидки = МаксимальнаяСуммаСкидки + СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		
	КонецЦикла;
	
	Если СуммаСкидкиКРаспределению > МаксимальнаяСуммаСкидки И НЕ ЭтоНаценка Тогда
		СуммаСкидкиКРаспределению = МаксимальнаяСуммаСкидки;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		
		СуммаБезСкидки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		
		Если МаксимальнаяСуммаСкидки <> 0 Тогда
			СтрокаТЧ.СкидкаНаценкаСумма = СуммаБезСкидки * (СуммаСкидкиКРаспределению / МаксимальнаяСуммаСкидки);
		Иначе
			СтрокаТЧ.СкидкаНаценкаСумма = 0;
		КонецЕсли;
		
		СуммаСкидкиКРаспределению = СуммаСкидкиКРаспределению - СтрокаТЧ.СкидкаНаценкаСумма;
		МаксимальнаяСуммаСкидки = МаксимальнаяСуммаСкидки - СуммаБезСкидки;
		
		Если СуммаБезСкидки <> 0 Тогда
			СтрокаТЧ.СкидкаНаценкаПроцент = 100 * СтрокаТЧ.СкидкаНаценкаСумма / СуммаБезСкидки;
		Иначе
			СтрокаТЧ.СкидкаНаценкаПроцент = 0;
		КонецЕсли;
		
		СуммаСкидки = СтрокаТЧ.СкидкаНаценкаСумма;
		
		Если ЭтоНаценка Тогда
			СтрокаТЧ.Сумма = СуммаБезСкидки + СуммаСкидки;
		Иначе
			СтрокаТЧ.Сумма = СуммаБезСкидки + ?(СуммаСкидки > СуммаБезСкидки, - СуммаБезСкидки, СуммаСкидки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


// Процедура формирования движений по регистру "Расчеты с поставщиками".
Процедура ОтразитьДвижениеНаличных(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредства;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДенежныеСредства.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ПроверитьВозможностьВыемкиДС(СуммаВыемки, Отказ, Сообщение) Экспорт
	
	Остаток = ПродажиВызовСервера.ПолучитьОстатокНаличныхВКассе();
	
	Если СуммаВыемки > Остаток Тогда
		
		Отказ = Истина;
		Сообщение = НСтр("ru = 'Недостаточно наличных в кассе. Остаток = %Остаток%'");
		Сообщение = СтрЗаменить(Сообщение, "%Остаток%", Остаток);
	КонецЕсли;
	
КонецПроцедуры

Функция ОтчетПоКассе(КассоваяСмена) Экспорт
	
	Отчет = Новый Структура;
	РеквизитыОтчета = "Наличные, Внесение, Выплата, Продажа, ПродажаНаличными, ПродажаПлатежнойКартой, Возврат, ВозвратНаличными, ВозвратПлатежнойКартой, Выручка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.СуммаОстаток КАК Наличные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(, ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплаты.Наличные)) КАК ДенежныеСредстваОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОбороты.СуммаОборот КАК Внесение
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплаты.Наличные)
	|				И КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Внесение)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	-ДенежныеСредстваОбороты.СуммаОборот КАК Выплата
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплаты.Наличные)
	|				И КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Изъятие)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОбороты.СуммаОборот КАК Продажа
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Продажа)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОбороты.СуммаОборот КАК ПродажаНаличными
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплаты.Наличные)
	|				И КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Продажа)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОбороты.СуммаОборот КАК ПродажаПлатежнойКартой
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплаты.ПлатежнаяКарта)
	|				И КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Продажа)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	-ДенежныеСредстваОбороты.СуммаОборот КАК Возврат
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Возврат)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	-ДенежныеСредстваОбороты.СуммаОборот КАК ВозвратНаличными
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплаты.Наличные)
	|				И КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Возврат)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	-ДенежныеСредстваОбороты.СуммаОборот КАК ВозвратПлатежнойКартой
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			,
	|			,
	|			,
	|			ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплаты.ПлатежнаяКарта)
	|				И КассоваяСмена = &КассоваяСмена
	|				И ВидДвиженияДС = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Возврат)) КАК ДенежныеСредстваОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.СуммаОстаток КАК Выручка
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(, ВидДвиженияДС В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Продажа), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Возврат))) КАК ДенежныеСредстваОстатки
	|ГДЕ
	|	ДенежныеСредстваОстатки.КассоваяСмена = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Реквизиты = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыОтчета,,,Истина);
	
	// Индексы реквизитов массива должны совпадать(!) с индексами результатов пакета запроса.
	Индекс = 0;
	Для Каждого ИмяРеквизита Из Реквизиты Цикл
		
		Результат = РезультатЗапроса[Индекс];
		
		Если Результат.Пустой() Тогда
			Значение = 0;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Значение = Выборка[ИмяРеквизита];
		КонецЕсли;
		
		Отчет.Вставить(ИмяРеквизита, Значение);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат Отчет;
	
КонецФункции

Функция ПолучитьТаблицуТоваровЧекаВозврата(ЧекПродажи, АдресТоваровВХранилище = Неопределено, ЧекВозврата = Неопределено, Номенклатура = Неопределено, АдресМарокВХранилище = Неопределено) Экспорт
	
	Если ЧекВозврата = Неопределено Тогда
		ЧекВозврата = Документы.Чек.ПустаяСсылка();
	КонецЕсли;
	
	ТоварыНезаписанногоДокумента = Новый ТаблицаЗначений;
	ТоварыНезаписанногоДокумента.Колонки.Добавить("Номенклатура",                    Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыНезаписанногоДокумента.Колонки.Добавить("Количество",                      Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТоварыНезаписанногоДокумента.Колонки.Добавить("Цена",                            Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТоварыНезаписанногоДокумента.Колонки.Добавить("НеобходимостьВводаАкцизнойМарки", Новый ОписаниеТипов("Булево"));
	ТоварыНезаписанногоДокумента.Колонки.Добавить("Штрихкод",                        Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	ТоварыНезаписанногоДокумента.Колонки.Добавить("ЦенаСУчетомСкидки",               Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	Если НЕ АдресТоваровВХранилище = Неопределено И НЕ ПустаяСтрока(АдресТоваровВХранилище) Тогда
		
		Товары = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
		
		Для Каждого СтрокаТовары Из Товары Цикл
			НоваяСтрока = ТоварыНезаписанногоДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыНезаписанногоДокумента.Номенклатура,
	|	ТоварыНезаписанногоДокумента.НеобходимостьВводаАкцизнойМарки,
	|	ТоварыНезаписанногоДокумента.Количество,
	|	ТоварыНезаписанногоДокумента.Штрихкод,
	|	ТоварыНезаписанногоДокумента.Цена,
	|	ТоварыНезаписанногоДокумента.ЦенаСУчетомСкидки
	|ПОМЕСТИТЬ ТоварыНезаписанногоДокумента
	|ИЗ
	|	&ТоварыНезаписанногоДокумента КАК ТоварыНезаписанногоДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.НеобходимостьВводаАкцизнойМарки,
	|	СУММА(Товары.Количество) КАК Количество,
	|	Товары.Цена,
	|	Товары.ЦенаСУчетомСкидки,
	|	Товары.ЕстьСкидка,
	|	Товары.Штрихкод,
	|	СУММА(Товары.СкидкаНаценкаСумма) КАК СкидкаНаценкаСумма,
	|	Товары.КлючСвязи
	|ПОМЕСТИТЬ ТоварыПродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекТовары.Номенклатура КАК Номенклатура,
	|		ЧекТовары.НеобходимостьВводаАкцизнойМарки КАК НеобходимостьВводаАкцизнойМарки,
	|		ЧекТовары.Количество КАК Количество,
	|		ЧекТовары.СкидкаНаценкаСумма КАК СкидкаНаценкаСумма,
	|		ЧекТовары.Штрихкод КАК Штрихкод,
	|		ЧекТовары.Цена КАК Цена,
	|		ВЫБОР
	|			КОГДА ЧекТовары.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(ЧекТовары.Сумма / ЧекТовары.Количество КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК ЦенаСУчетомСкидки,
	|		ВЫБОР
	|			КОГДА ЧекТовары.СкидкаНаценкаСумма = 0
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ЕстьСкидка,
	|		ЧекТовары.КлючСвязи КАК КлючСвязи
	|	ИЗ
	|		Документ.Чек.Товары КАК ЧекТовары
	|	ГДЕ
	|		ЧекТовары.Ссылка = &ЧекПродажи) КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.НеобходимостьВводаАкцизнойМарки,
	|	Товары.ЕстьСкидка,
	|	Товары.Номенклатура,
	|	Товары.Штрихкод,
	|	Товары.Цена,
	|	Товары.ЦенаСУчетомСкидки,
	|	Товары.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НеобходимостьВводаАкцизнойМарки,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.ЦенаСУчетомСкидки
	|ПОМЕСТИТЬ ТоварыВозврата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекТовары.Номенклатура КАК Номенклатура,
	|		ЧекТовары.НеобходимостьВводаАкцизнойМарки КАК НеобходимостьВводаАкцизнойМарки,
	|		ЧекТовары.Штрихкод КАК Штрихкод,
	|		СУММА(ЧекТовары.Количество) КАК Количество,
	|		ЧекТовары.Цена КАК Цена,
	|		ЧекТовары.ЦенаСУчетомСкидки КАК ЦенаСУчетомСкидки
	|	ИЗ
	|		Документ.Чек.Товары КАК ЧекТовары
	|	ГДЕ
	|		ЧекТовары.Ссылка.ЧекПродажи = &ЧекПродажи
	|		И НЕ ЧекТовары.Ссылка.СтатусЧека = ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Аннулирован)
	|		И НЕ ЧекТовары.Ссылка = &ЧекВозврата
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЧекТовары.Номенклатура,
	|		ЧекТовары.НеобходимостьВводаАкцизнойМарки,
	|		ЧекТовары.Штрихкод,
	|		ЧекТовары.Цена,
	|		ЧекТовары.ЦенаСУчетомСкидки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНезаписанногоДокумента.Номенклатура,
	|		ТоварыНезаписанногоДокумента.НеобходимостьВводаАкцизнойМарки,
	|		ТоварыНезаписанногоДокумента.Штрихкод,
	|		ТоварыНезаписанногоДокумента.Количество,
	|		ТоварыНезаписанногоДокумента.Цена,
	|		ТоварыНезаписанногоДокумента.ЦенаСУчетомСкидки
	|	ИЗ
	|		ТоварыНезаписанногоДокумента КАК ТоварыНезаписанногоДокумента) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НеобходимостьВводаАкцизнойМарки,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.ЦенаСУчетомСкидки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|		ЧекАкцизныеМарки.КодАкцизнойМарки КАК КодАкцизнойМарки
	|ПОМЕСТИТЬ АкцизныеМаркиВозврата
	|	ИЗ
	|		Документ.Чек.АкцизныеМарки КАК ЧекАкцизныеМарки
	|	ГДЕ
	|		ЧекАкцизныеМарки.Ссылка.ЧекПродажи = &ЧекПродажи
	|		И НЕ ЧекАкцизныеМарки.Ссылка.СтатусЧека = ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Аннулирован)
	|		И НЕ ЧекАкцизныеМарки.Ссылка = &ЧекВозврата
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПродажи.Номенклатура,
	|	ТоварыПродажи.НеобходимостьВводаАкцизнойМарки КАК НеобходимостьВводаАкцизнойМарки,
	|	ТоварыПродажи.КлючСвязи,
	|	ТоварыПродажи.Номенклатура КАК Ссылка,
	|	ТоварыПродажи.Номенклатура.Артикул КАК Артикул,
	|	ТоварыПродажи.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТоварыПродажи.Номенклатура.Избранное КАК Избранное,
	|	ТоварыПродажи.Номенклатура.Наименование КАК Наименование,
	|	ТоварыПродажи.Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	ТоварыПродажи.Номенклатура.Родитель КАК Родитель,
	|	ТоварыПродажи.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	ТоварыПродажи.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыПродажи.Штрихкод КАК Штрихкод,
	|	ТоварыПродажи.Цена,
	|	ТоварыПродажи.ЦенаСУчетомСкидки,
	|	ТоварыПродажи.ЕстьСкидка,
	|	ТоварыПродажи.Количество - ЕСТЬNULL(ТоварыВозврата.Количество, 0) КАК Количество,
	|	ТоварыПродажи.Количество КАК КоличествоПродажи,
	|	ЕСТЬNULL(ТоварыВозврата.Количество, 0) КАК КоличествоВозврата,
	|	ТоварыПродажи.СкидкаНаценкаСумма КАК СкидкаНаценкаСуммаПродажи,
	|	0 КАК СкидкаНаценкаСумма,
	|	0 КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК АкцизныеМарки
	|ИЗ
	|	ТоварыПродажи КАК ТоварыПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВозврата КАК ТоварыВозврата
	|		ПО ТоварыПродажи.Номенклатура = ТоварыВозврата.Номенклатура
	|			И ТоварыПродажи.ЦенаСУчетомСкидки = ТоварыВозврата.ЦенаСУчетомСкидки
	|ГДЕ
	|	НЕ ТоварыПродажи.Количество - ЕСТЬNULL(ТоварыВозврата.Количество, 0) = 0
	|	%УсловиеНоменклатура%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекАкцизныеМарки.КлючСвязи,
	|	ЧекАкцизныеМарки.КодАкцизнойМарки,
	|	АкцизныеМаркиВозврата.КодАкцизнойМарки КАК КодАкцизнойМаркиВозврата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЧекАкцизныеМарки.КлючСвязи КАК КлючСвязи,
	|		ЧекАкцизныеМарки.КодАкцизнойМарки КАК КодАкцизнойМарки
	|	ИЗ
	|		Документ.Чек.АкцизныеМарки КАК ЧекАкцизныеМарки
	|	ГДЕ
	|		ЧекАкцизныеМарки.Ссылка = &ЧекПродажи) КАК ЧекАкцизныеМарки
	|		ЛЕВОЕ СОЕДИНЕНИЕ АкцизныеМаркиВозврата КАК АкцизныеМаркиВозврата
	|		ПО ЧекАкцизныеМарки.КодАкцизнойМарки = АкцизныеМаркиВозврата.КодАкцизнойМарки
	|ГДЕ
	|	АкцизныеМаркиВозврата.КодАкцизнойМарки ЕСТЬ NULL ";
	
	Если Номенклатура = Неопределено Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеНоменклатура%", "");
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеНоменклатура%", "И ТоварыПродажи.Номенклатура = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ЧекПродажи", ЧекПродажи);
	Запрос.УстановитьПараметр("ТоварыНезаписанногоДокумента", ТоварыНезаписанногоДокумента);
	Запрос.УстановитьПараметр("ЧекВозврата", ЧекВозврата);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	Товары         = РезультатПакет[4].Выгрузить();
	АкцизныеМарки  = РезультатПакет[5].Выгрузить();
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТоваров.КлючСвязи) Тогда
			
			НайденныеСтроки = АкцизныеМарки.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаТоваров.КлючСвязи));
			
			МассивМарок = Новый Массив;
			
			Если НайденныеСтроки.Количество() = СтрокаТоваров.Количество Тогда
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
					МассивМарок.Добавить(НайденнаяСтрока.КодАкцизнойМарки);
				КонецЦикла;
			КонецЕсли;
			
			СтрокаТоваров.АкцизныеМарки = МассивМарок;
			
		КонецЕсли;
		
		ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуВозвратаПоПродаже(СтрокаТоваров);
	КонецЦикла;
	
	Возврат Товары;
	
КонецФункции

Функция ОтчетПоКассеКоличествоОпераций(КассоваяСмена) Экспорт
	
	Отчет = Новый Структура;
	РеквизитыОтчета = "КоличествоПродаж, КоличествоВозвратов, КоличествоВнесений, КоличествоВыплат";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Чек.Ссылка) КАК КоличествоПродаж
	|ИЗ
	|	Документ.Чек КАК Чек
	|ГДЕ
	|	Чек.КассоваяСмена = &КассоваяСмена
	|	И Чек.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))
	|	И Чек.ВидОперации = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Чек.Ссылка) КАК КоличествоВозвратов
	|ИЗ
	|	Документ.Чек КАК Чек
	|ГДЕ
	|	Чек.КассоваяСмена = &КассоваяСмена
	|	И Чек.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))
	|	И Чек.ВидОперации = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнесениеИзъятиеНаличных.Ссылка) КАК КоличествоВнесений
	|ИЗ
	|	Документ.ВнесениеИзъятиеНаличных КАК ВнесениеИзъятиеНаличных
	|ГДЕ
	|	ВнесениеИзъятиеНаличных.Проведен
	|	И ВнесениеИзъятиеНаличных.КассоваяСмена = &КассоваяСмена
	|	И ВнесениеИзъятиеНаличных.ВидДвиженияНаличных = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Внесение);
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнесениеИзъятиеНаличных.Ссылка) КАК КоличествоВыплат
	|ИЗ
	|	Документ.ВнесениеИзъятиеНаличных КАК ВнесениеИзъятиеНаличных
	|ГДЕ
	|	ВнесениеИзъятиеНаличных.Проведен
	|	И ВнесениеИзъятиеНаличных.КассоваяСмена = &КассоваяСмена
	|	И ВнесениеИзъятиеНаличных.ВидДвиженияНаличных = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Изъятие)";
	
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Реквизиты = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыОтчета,,,Истина);
	
	// Индексы реквизитов массива должны совпадать(!) с индексами результатов пакета запроса.
	Индекс = 0;
	Для Каждого ИмяРеквизита Из Реквизиты Цикл
		
		Результат = РезультатЗапроса[Индекс];
		
		Если Результат.Пустой() Тогда
			Значение = 0;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Значение = Выборка[ИмяРеквизита];
		КонецЕсли;
		
		Отчет.Вставить(ИмяРеквизита, Значение);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат Отчет;
	
КонецФункции

#КонецОбласти

#Область Отчеты

Функция ПолучитьКассовуюСменуДляОтчета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Закрыта,
	|	КассоваяСмена.ОкончаниеКассовойСмены УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОтчетПоПродажам(КассоваяСмена = Неопределено, Период = Неопределено, Кассир = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КассоваяСмена.НачалоКассовойСмены,
	|	КассоваяСмена.ОкончаниеКассовойСмены,
	|	КассоваяСмена.Закрыта,
	|	КассоваяСмена.Номер,
	|	КассоваяСмена.Дата
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Ссылка = &КассоваяСмена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекТовары.Номенклатура КАК Товар,
	|	СУММА(ЧекТовары.Количество) КАК Количество,
	|	СУММА(ЧекТовары.Сумма) КАК Сумма,
	|	ЧекТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ЧекТовары.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.Чек.Товары КАК ЧекТовары
	|ГДЕ
	|	%Условие%
	|	%УсловиеКассир%
	|	И ЧекТовары.Ссылка.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))
	|	И ЧекТовары.Ссылка.ВидОперации = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекТовары.Номенклатура,
	|	ЧекТовары.Номенклатура.ЕдиницаИзмерения,
	|	ЧекТовары.Номенклатура.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекТовары.Номенклатура КАК Товар,
	|	СУММА(ЧекТовары.Количество) КАК Количество,
	|	СУММА(ЧекТовары.Сумма) КАК Сумма,
	|	ЧекТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ЧекТовары.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.Чек.Товары КАК ЧекТовары
	|ГДЕ
	|	%Условие%
	|	%УсловиеКассир%
	|	И ЧекТовары.Ссылка.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))
	|	И ЧекТовары.Ссылка.ВидОперации = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекТовары.Номенклатура,
	|	ЧекТовары.Номенклатура.ЕдиницаИзмерения,
	|	ЧекТовары.Номенклатура.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	
	Если КассоваяСмена = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие%", "ЧекТовары.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо");
		Запрос.УстановитьПараметр("ДатаС", Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаПо", Период.ДатаОкончания);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие%", "ЧекТовары.Ссылка.КассоваяСмена = &КассоваяСмена");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Кассир) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеКассир%", "И ЧекТовары.Ссылка.КассоваяСмена.Кассир = &Кассир");
		Запрос.УстановитьПараметр("Кассир", Кассир);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеКассир%", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИнфоОСмене = РезультатЗапроса[0].Выбрать();
	ТаблицаПродажи = РезультатЗапроса[1].Выгрузить();
	ТаблицаВозвраты = РезультатЗапроса[2].Выгрузить();
	
	СтатусСмены    = "";
	НачалоСмены    = "";
	ОкончаниеСмены = "";
	ДатаСмены      = "";
	НомерСмены     = "";
	
	Если ИнфоОСмене.Следующий() Тогда
		СтатусСмены    = ?(ИнфоОСмене.Закрыта, "Закрыта", "Открыта");
		НачалоСмены    = ИнфоОСмене.НачалоКассовойСмены;
		ОкончаниеСмены = ИнфоОСмене.ОкончаниеКассовойСмены;
		ДатаСмены      = Формат(ИнфоОСмене.Дата, "ДФ=dd.MM.yy");
		НомерСмены     = ОбщегоНазначенияКлиентСервер.ПредставлениеНомера(ИнфоОСмене.Номер);
	КонецЕсли;
	
	СтруктураОтчета = Новый Структура;
	СтруктураОтчета.Вставить("ТаблицаПродажи", ТаблицаПродажи);
	СтруктураОтчета.Вставить("ТаблицаВозвраты", ТаблицаВозвраты);
	
	СтруктураОтчета.Вставить("СтатусСмены",    СтатусСмены);
	СтруктураОтчета.Вставить("НачалоСмены",    НачалоСмены);
	СтруктураОтчета.Вставить("ОкончаниеСмены", ОкончаниеСмены);
	СтруктураОтчета.Вставить("Дата",           ДатаСмены);
	СтруктураОтчета.Вставить("Номер",          НомерСмены);
	
	Возврат СтруктураОтчета;
	
КонецФункции

Функция ОтчетПоКассеТекстовый(КассоваяСмена) Экспорт
	
	ОтчетПоКассе = ОтчетПоКассе(КассоваяСмена);
	
	ТекстовыйШаблонОтчета = НСтр("ru = 'Кассовая смена %НомерСмены% от %ДатаСмены%
	|
	|Статус: %СтатусСмены%
	|Начало смены: %НачалоСмены%
	|Окончание смены: %ОкончаниеСмены%
	|
	|Наличные: %Наличные%
	|Выручка: %Выручка%
	|
	|Продажа: %ПродажиСумма%
	|Наличными: %ПродажиНаличные%
	|Платежной картой: %ПродажиБезналичные%
	|
	|Возврат: %ВозвратСумма%
	|Наличными: %ВозвратНаличные%
	|Платежной картой: %ВозвратБезналичные%
	|
	|Внесение: %Внесение%
	|Выемка: %Выплата%
	|'");

	
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйШаблонОтчета, "%НомерСмены%", ОбщегоНазначенияКлиентСервер.ПредставлениеНомера(КассоваяСмена.Номер));
	
	ФорматСуммы = ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей();
	
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ДатаСмены%", 			КассоваяСмена.Дата);
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%СтатусСмены%", 			?(КассоваяСмена.Закрыта, "Закрыта", "Открыта"));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%НачалоСмены%", 			КассоваяСмена.НачалоКассовойСмены);
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ОкончаниеСмены%", 		Формат(КассоваяСмена.ОкончаниеКассовойСмены, "ДП=-"));
	
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%Наличные%", 				Формат(ОтчетПоКассе.Наличные, 					ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%Выручка%", 				Формат(ОтчетПоКассе.Выручка, 					ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ПродажиСумма%", 			Формат(ОтчетПоКассе.Продажа, 					ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ПродажиНаличные%", 		Формат(ОтчетПоКассе.ПродажаНаличными, 			ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ПродажиБезналичные%", 	Формат(ОтчетПоКассе.ПродажаПлатежнойКартой, 	ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ВозвратСумма%", 			Формат(ОтчетПоКассе.Возврат, 					ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ВозвратНаличные%", 		Формат(ОтчетПоКассе.ВозвратНаличными, 			ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%ВозвратБезналичные%", 	Формат(ОтчетПоКассе.ВозвратПлатежнойКартой, 	ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%Внесение%", 				Формат(ОтчетПоКассе.Внесение, 					ФорматСуммы));
	ТекстовыйОтчет = СтрЗаменить(ТекстовыйОтчет, "%Выплата%", 				Формат(ОтчетПоКассе.Выплата, 					ФорматСуммы));
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ТекстПисьма", ТекстовыйОтчет);
	
	ШаблонТемыПисьма = НСтр("ru = 'Отчет по кассовой смене %НомерСмены% от %ДатаСмены%'");
	ТемаПисьма = СтрЗаменить(ШаблонТемыПисьма, "%НомерСмены%", КассоваяСмена.Номер);
	ТемаПисьма = СтрЗаменить(ТемаПисьма, "%ДатаСмены%", КассоваяСмена.Дата);
	
	СтруктураРезультат.Вставить("ТемаПисьма", ТемаПисьма);
	
	Возврат СтруктураРезультат;

КонецФункции

Функция ОтчетПоПродажамТекстовый(КассоваяСмена = Неопределено, Период = Неопределено) Экспорт
	
	ОтчетПоПродажам = ПолучитьОтчетПоПродажам(КассоваяСмена, Период);
	
	ШаблонСтроки = НСтр("ru = '%НомерСтроки%. %Номенклатура%
								|%Количество% %ЕдИзм% %Сумма%
								|'");
	
	ТекстПисьма = "";
	
	// Продажа
	ТаблицаПродажи = ОтчетПоПродажам.ТаблицаПродажи;
	НомерСтроки = 1;
	ТекстПисьма = ТекстПисьма + Символы.ПС + НСтр("ru = 'Продажа'") + Символы.ПС + Символы.ПС;
	
	Для Каждого Строка Из ТаблицаПродажи Цикл
		
		ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", НомерСтроки);
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Номенклатура%", Строка.Наименование);
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Количество%", Формат(Строка.Количество, "ЧЦ=15; ЧДЦ=3; ЧРД=,; ЧН=0,00"));
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%ЕдИзм%", Строка.ЕдИзм);
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Сумма%",Формат(Строка.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=0,00"));
		
		ТекстПисьма = ТекстПисьма + ТекстСтроки + Символы.ПС;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Итого = ТаблицаПродажи.Итог("Сумма");
	ШаблонИтого = НСтр("ru = 'Итого: %Итого%'");
	ТекстИтого = СтрЗаменить(ШаблонИтого, "%Итого%", Формат(Итого, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=0,00"));
	
	ТекстПисьма = ТекстПисьма + ТекстИтого;
	
	// Возвраты товаров
	ТаблицаВозвраты = ОтчетПоПродажам.ТаблицаВозвраты;
	НомерСтроки = 1;
	ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.ПС + Символы.ПС + НСтр("ru = 'Возврат'") + Символы.ПС + Символы.ПС;
	
	Для Каждого Строка Из ТаблицаВозвраты Цикл
		
		ТекстСтроки = СтрЗаменить(ШаблонСтроки, "%НомерСтроки%", НомерСтроки);
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Номенклатура%", Строка.Наименование);
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Количество%", Формат(Строка.Количество, "ЧЦ=15; ЧДЦ=3; ЧРД=,; ЧН=0,00"));
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%ЕдИзм%", Строка.ЕдИзм);
		ТекстСтроки = СтрЗаменить(ТекстСтроки, "%Сумма%",Формат(Строка.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=0,00"));
		
		ТекстПисьма = ТекстПисьма + ТекстСтроки + Символы.ПС;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Итого = ТаблицаВозвраты.Итог("Сумма");
	ШаблонИтого = НСтр("ru = 'Итого: %Итого%'");
	ТекстИтого = СтрЗаменить(ШаблонИтого, "%Итого%", Формат(Итого, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=0,00"));
	
	ТекстПисьма = ТекстПисьма + ТекстИтого;

	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ТекстПисьма", ТекстПисьма);
	
	Если КассоваяСмена = Неопределено Тогда
		
		ШаблонТемыПисьма = НСтр("ru = 'Продажи с %ДатаС% от %ДатаПо%'");
		
		ТемаПисьма = СтрЗаменить(ШаблонТемыПисьма, "%ДатаС%", Формат(Период.ДатаНачала, "ДЛФ=D"));
		ТемаПисьма = СтрЗаменить(ТемаПисьма, "%ДатаПо%", Формат(Период.ДатаОкончания, "ДЛФ=D"));
		
		СтруктураРезультат.Вставить("ТемаПисьма", ТемаПисьма);
		
	Иначе
		ШаблонТемыПисьма = НСтр("ru = 'Продажи за кассовую смену %НомерСмены% от %ДатаСмены%'");
		ТемаПисьма = СтрЗаменить(ШаблонТемыПисьма, "%НомерСмены%", ОтчетПоПродажам.Номер);
		ТемаПисьма = СтрЗаменить(ТемаПисьма, "%ДатаСмены%", ОтчетПоПродажам.Дата);
		
		СтруктураРезультат.Вставить("ТемаПисьма", ТемаПисьма);
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

Функция ПолучитьЖурналПродажиАлкогольнойПродукции(Период) Экспорт
	
	Журнал = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаименованиеОрганизации.Значение КАК НазваниеОрганизации,
	|	ИНН.Значение КАК ИННКПП
	|ИЗ
	|	Константа.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	Константа.ИНН КАК ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЧекТовары.Ссылка.Дата, ДЕНЬ) КАК День,
	|	ЧекТовары.Номенклатура,
	|	ЧекТовары.Количество,
	|	ЧекТовары.Номенклатура.ОбъемАлкогольнойПродукции * ЧекТовары.Количество КАК Емкость
	|ПОМЕСТИТЬ ПродажиВозвратыАлкоголя
	|ИЗ
	|	Документ.Чек.Товары КАК ЧекТовары
	|ГДЕ
	|	ЧекТовары.Номенклатура.АлкогольнаяПродукция
	|	И ЧекТовары.Ссылка.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))
	|	И ЧекТовары.Ссылка.ВидОперации = &ВидОперацииПродажа
	|	И ЧекТовары.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЧекТовары.Ссылка.Дата, ДЕНЬ),
	|	ЧекТовары.Номенклатура,
	|	-ЧекТовары.Количество,
	|	-ЧекТовары.Номенклатура.ОбъемАлкогольнойПродукции * ЧекТовары.Количество
	|ИЗ
	|	Документ.Чек.Товары КАК ЧекТовары
	|ГДЕ
	|	ЧекТовары.Номенклатура.АлкогольнаяПродукция
	|	И ЧекТовары.Ссылка.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))
	|	И ЧекТовары.Ссылка.ВидОперации = &ВидОперацииВозврат
	|	И ЧекТовары.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиВозвратыАлкоголя.День КАК ДатаПродажи,
	|	ПродажиВозвратыАлкоголя.Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ПродажиВозвратыАлкоголя.Номенклатура) КАК НаименованиеПродукции,
	|	СУММА(ПродажиВозвратыАлкоголя.Количество) КАК Количество,
	|	СУММА(ПродажиВозвратыАлкоголя.Емкость) КАК Емкость,
	|	ПродажиВозвратыАлкоголя.Номенклатура.ВидАлкогольнойПродукции.Код КАК КодВидаПродукции
	|ИЗ
	|	ПродажиВозвратыАлкоголя КАК ПродажиВозвратыАлкоголя
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиВозвратыАлкоголя.День,
	|	ПродажиВозвратыАлкоголя.Номенклатура,
	|	ПродажиВозвратыАлкоголя.Номенклатура.ВидАлкогольнойПродукции.Код";
	
	Запрос.УстановитьПараметр("ВидОперацииПродажа", 0);
	Запрос.УстановитьПараметр("ВидОперацииВозврат", 1);
	Запрос.УстановитьПараметр("ДатаС",  Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаПо", Период.ДатаОкончания);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	РезультатШапка = РезультатПакет[0];
	
	ВыборкаШапка = РезультатШапка.Выбрать();
	ВыборкаШапка.Следующий();
	
	Журнал.Вставить("НазваниеОрганизации", ВыборкаШапка.НазваниеОрганизации);
	Журнал.Вставить("ИННКПП", ВыборкаШапка.ИННКПП);
	Журнал.Вставить("Товары", РезультатПакет[2].Выгрузить());
	
	Возврат Журнал;
	
КонецФункции

#КонецОбласти
